{
        "sales":   
        {
    "title":"Sales Data Analysis",
    "banner_image": "images/Sales.jpg",
    "description":"This project focuses on applying data science techniques to sales functions within an organization. It outlines customer segmentation, customer lifetime value analysis, and sales forecasting to enhance marketing, guide customer retention strategies, and enable data-driven business decisions. The proposal utilizes Python and R along with libraries like Pandas, Scikit-learn, and TensorFlow to cluster customers, predict future revenue, and build forecasting models.",
    "sections":["Data Cleaning & EDA","Customer Segmentation","Customer Lifetime Value","Sales Forecasting"],
    "section_text":["The data cleaning process handles missing values and outliers. EDA utilizes Pandas and Matplotlib to analyze the distribution of customer age, gender breakdown, average transaction amount, purchase frequency, and other metrics. Visualizations like histograms and scatter plots are created to uncover insights.",
                "This notebook performs exploratory data analysis on a dataset of customer demographics, purchase history, and online behavior. It utilizes Python and Pandas to analyze metrics like average transaction amount, purchase frequency, and customer age distribution. The analysis aims to uncover insights to guide customer segmentation for targeted marketing. ",
                " This notebook builds a machine learning model to predict customer lifetime value based on purchase history data. It applies data preprocessing, feature engineering, and model selection techniques in Python. The best performing XGBoost model is interpreted to identify key drivers of high customer lifetime value.",
                "This notebook forecasts product demand using Facebook Prophet. Historical sales data is prepared and fed into the model which captures trends, seasonality, and holiday effects. The optimized model provides accurate monthly and weekly demand forecasts to guide inventory planning. "
                ],
    "tools":["Python, Pandas & Matplotlib","Pandas, Seaborn & KMeans","Numpy, Lifetimes & Matplotlib","StatsModels, Sci-kit Learn & XGBoost"],
    "urls":["https://github.com/MakalaMabotja/Sales-Data-Project/blob/main/Sales%20data%20cleaning%20%26%20EDA.ipynb",
            "https://github.com/MakalaMabotja/Sales-Data-Project/blob/main/RFM%20clustering.ipynb",
            "https://github.com/MakalaMabotja/Sales-Data-Project/blob/main/CLTV%20analysis.ipynb",
            "https://github.com/MakalaMabotja/Sales-Data-Project/blob/main/Sales%20Forecasting.ipynb"],
    "images":[
            "images/data_cleaning.jpg",
            "images/customer_segmentation.jpg",
            "images/customer_value.jpg",
            "images/sales_forecasting.jpg"
    ],
    "notes":["For the clustering, I need to do a scatterplot of the RFM with the size of the plot being Monerary and the colour being the cluster",
            "For the urls, I will be linking the github code repository for now."]

},
"churn":{}
}